{
  "meta": {
    "description": "QuakeFall feature contract. Features start as 'failing' and flip to 'passing' only after full validation. Never remove or edit feature specs — only update status.",
    "workflow": "docs/anthropic-long-running-agents.md",
    "progress": "claude-progress.txt"
  },
  "features": [
    {
      "name": "build-script",
      "category": "tooling",
      "description": "tools/build.sh: Single command compiles native server + client + QVMs, copies QVMs to demoq3, reports errors. Supports 'native', 'wasm', 'all' targets. Exit code 0 = success.",
      "status": "passing",
      "validation": "Run tools/build.sh, verify exit code 0, verify binaries updated"
    },
    {
      "name": "server-management",
      "category": "tooling",
      "description": "tools/server.sh: start/stop/restart/status/log subcommands. Checks for duplicate processes before starting. Starts with correct flags (vm_game 0, demoq3, sv_pure 0). Sets rcon password for automation. Env vars QF_MAP and QF_RCON for overrides.",
      "status": "passing",
      "validation": "tools/server.sh start → server running. status → shows PID. stop → server dead. log → shows recent output."
    },
    {
      "name": "rcon-client",
      "category": "tooling",
      "description": "tools/rcon.py: Send rcon commands to running ioq3ded, print response to stdout. Usage: python3 tools/rcon.py 'status'. Default password 'dev', default localhost:27960.",
      "status": "passing",
      "validation": "Start server with rcon enabled, run tools/rcon.py 'status', verify response printed"
    },
    {
      "name": "map-compile-script",
      "category": "tooling",
      "description": "tools/compile_map.sh: Compile and deploy .map file with single command. Runs BSP/VIS/LIGHT passes, copies BSP to both native and WASM build dirs. Usage: tools/compile_map.sh maps/qfcity1.map",
      "status": "passing",
      "validation": "tools/compile_map.sh maps/qfcity1.map succeeds, BSP exists in both build dirs"
    },
    {
      "name": "titan-part-definitions",
      "category": "titan-hitbox",
      "description": "bg_titan_parts.h: Shared header defining titan part table. Part enum (TITAN_PART_TORSO, _COCKPIT, _ARM_L, _ARM_R, _LEG_L, _LEG_R, _VENT). Each part has: local offset (vec3), dimensions (mins/maxs), damage multiplier (float), debug color (RGBA). Shared between game and cgame.",
      "status": "passing",
      "validation": "Header compiles clean in both game and cgame modules"
    },
    {
      "name": "titan-content-flag",
      "category": "titan-hitbox",
      "description": "CONTENTS_TITANPART content flag in surfaceflags.h (bit 0x0400). Added to MASK_SHOT so weapon traces detect titan parts. NOT added to MASK_PLAYERSOLID so player movement ignores them. Titan part entities use this flag as their r.contents.",
      "status": "passing",
      "validation": "Flag defined, MASK_SHOT includes it, code compiles, player movement unaffected"
    },
    {
      "name": "titan-child-spawn",
      "category": "titan-hitbox",
      "description": "When player enters titan mode (/titan), spawn child hitbox entities (ET_TITAN_PART) for each part in the part table. Set r.contents=CONTENTS_TITANPART, r.ownerNum=parent, takedamage=qtrue. Store child entity pointers on parent gclient_t. Link all entities.",
      "status": "passing",
      "validation": "Enter titan mode, /titan_parts shows all child entities spawned with correct part types"
    },
    {
      "name": "titan-child-despawn",
      "category": "titan-hitbox",
      "description": "When player exits titan mode, G_FreeEntity all child hitbox entities. Clear stored pointers on parent gclient_t. No entity leaks across multiple enter/exit cycles.",
      "status": "passing",
      "validation": "Enter/exit titan mode 5 times, /titan_parts shows no orphaned children, entity count stable"
    },
    {
      "name": "titan-child-positioning",
      "category": "titan-hitbox",
      "description": "Every server frame in ClientThink or G_RunFrame, update each child entity's r.currentOrigin based on: parent origin + yaw-rotated local offset from part table. Set r.mins/r.maxs from part table. Call trap_LinkEntity. Children track parent smoothly.",
      "status": "passing",
      "validation": "Enter titan mode, move and turn, /titan_parts shows children tracking parent. Offsets rotate with yaw."
    },
    {
      "name": "titan-debug-rendering",
      "category": "titan-hitbox",
      "description": "cg_titanDebug cvar (default 0). Value 1: translucent colored boxes for each titan part entity using trap_R_AddPolyToScene + whiteShader. Part colors from bg_titan_parts.h. Rendered in CG_AddPacketEntities for ET_TITAN_PART entity types.",
      "status": "passing",
      "validation": "Set cg_titanDebug 1 in native client, enter titan mode, see colored boxes."
    },
    {
      "name": "titan-debug-command",
      "category": "titan-hitbox",
      "description": "Server-side console command /titan_parts: prints all child entity state for the calling player. Output: part name, entity number, world position, mins/maxs, damage multiplier. Also works via rcon for headless debugging.",
      "status": "passing",
      "validation": "Enter titan mode, /titan_parts prints structured output. Also: tools/rcon.py 'titan_parts' returns data."
    },
    {
      "name": "titan-damage-routing",
      "category": "titan-hitbox",
      "description": "When a child hitbox entity receives damage (pain callback), route damage to parent player entity. Apply the part's damage multiplier from the part table. Attacker gets kill credit. Child entity itself has no health pool — all damage flows to parent.",
      "status": "passing",
      "validation": "Shoot titan's cockpit (2x), verify parent takes double damage. Shoot arm (0.5x), verify half. Kill from part hit credits attacker."
    },
    {
      "name": "titan-damage-log",
      "category": "titan-hitbox",
      "description": "Server cvar titan_damage_log (default 0). When 1, every hit on a titan part prints: attacker name, part name, weapon, raw damage, multiplier, final damage applied. Readable via server log or rcon.",
      "status": "passing",
      "validation": "Set titan_damage_log 1, shoot titan parts, see detailed per-hit log in server console/log"
    },
    {
      "name": "titan-crouch",
      "category": "titan-animation",
      "description": "Titan crouching adjusts the hitbox golem. When the titan player crouches, all hitbox part offsets and dimensions compress vertically to match TITAN_CROUCH_HEIGHT. Parts shift down and shrink proportionally — the golem visibly squats. Server-side (affects collision) and client-side (debug rendering updates). Crouch/stand transitions should be smooth, not instant.",
      "status": "passing",
      "validation": "Enter titan mode, crouch. cg_titanDebug shows golem compressed. Shoot crouched titan — hits register at correct new positions. Stand back up — golem returns to full height."
    },
    {
      "name": "titan-walk-animation",
      "category": "titan-animation",
      "description": "Basic procedural walking animation on the hitbox golem. When the titan moves, legs swing forward/back alternately and arms counter-swing. Offsets and sizes of leg and arm parts oscillate based on movement speed and a simple sin/cos cycle synced to server time. Stationary titan returns to idle pose. Server-side part positions update so animated hitboxes affect actual shot collision.",
      "status": "passing",
      "validation": "Enter titan mode, walk around with cg_titanDebug 1. Legs and arms visibly swing. Stop moving — golem returns to idle. Shoot a moving titan's swinging leg — hit registers on leg part with correct multiplier."
    },
    {
      "name": "titan-entity-callin",
      "category": "titan-enterxit",
      "description": "Console command /calltitan: spawns a titan entity (ET_GENERAL with a visible model or debug box) that drops from sky to ground near the player. Lands after ~3 second delay. Becomes boardable once landed. One titan per player max.",
      "status": "passing",
      "validation": "Use /calltitan, titan entity appears and descends to ground. Visual confirmation required."
    },
    {
      "name": "titan-embark",
      "category": "titan-enterxit",
      "description": "Player approaches landed titan, uses /embark or +use key within range. Player enters titan mode with full hitbox children. Titan world entity is consumed (freed). Player inherits titan's position.",
      "status": "passing",
      "validation": "Call titan, wait for landing, embark. Player gains titan mode + hitbox children. Debug rendering confirms."
    },
    {
      "name": "titan-disembark",
      "category": "titan-enterxit",
      "description": "Player uses /disembark while in titan mode. Player ejected to side of titan as pilot with base health. Titan entity either despawns or remains as empty hull (design TBD). Child hitboxes despawned.",
      "status": "passing",
      "validation": "Disembark from titan. Player returns to pilot size/speed/health. No child hitbox entities remain."
    },
    {
      "name": "titan-destruction",
      "category": "titan-enterxit",
      "description": "When titan (parent player) health reaches 0 while in titan mode: force-eject pilot, destroy titan, pilot spawns with base pilot health. Kill credit to attacker. Titan cooldown timer starts.",
      "status": "passing",
      "validation": "Kill a titan. Pilot ejected alive with base health. Attacker gets kill credit. Titan mode off."
    },
    {
      "name": "parkour-cvars",
      "category": "parkour",
      "description": "All parkour movement parameters registered as server cvars: pm_wallrunMinSpeed, pm_wallrunDuration, pm_wallrunGravity, pm_wallrunPull, pm_wallrunUpForce, pm_wallrunDetectDist, pm_walljumpForce, pm_walljumpUpForce, pm_doublejumpVelocity, pm_slideMinSpeed, pm_slideFriction, pm_ledgeGrabRange, pm_ledgeGrabHeight, pm_ledgeClimbSpeed, pm_vaultMaxHeight, pm_vaultSpeed. Synced from server cvars to bg_pmove globals each frame.",
      "status": "passing",
      "validation": "Start server, verify cvars exist with default values via rcon. Change a cvar, verify new value takes effect."
    },
    {
      "name": "parkour-wallrun",
      "category": "parkour",
      "description": "Wall run mechanic: when airborne near a vertical wall while pressing forward with enough speed, player runs along the wall surface with reduced gravity. Duration limited by pm_wallrunDuration. Adhesion pull keeps player attached through surface irregularities. PMF_WALLRUN flag tracks state, ps->generic1 tracks remaining duration. Pilots only (titans blocked).",
      "status": "passing",
      "validation": "Jump near a wall while moving forward. Player attaches and runs along wall with reduced gravity. Falls off after duration expires or forward released."
    },
    {
      "name": "parkour-walljump",
      "category": "parkour",
      "description": "Wall jump: pressing jump during wall run kicks player off wall with perpendicular force (pm_walljumpForce) plus upward boost (pm_walljumpUpForce). Detaches from wall run. Allows chaining between walls.",
      "status": "passing",
      "validation": "Wall run, press jump. Player launches off wall with force. Can chain: wall run right wall, wall jump to left wall, wall run left wall."
    },
    {
      "name": "parkour-doublejump",
      "category": "parkour",
      "description": "Double jump: pressing jump while airborne (not on ground, not wall running) performs a second weaker jump (pm_doublejumpVelocity). One per air time — PMF_DOUBLEJUMP flag consumed on use, cleared on landing. Pilots only.",
      "status": "passing",
      "validation": "Jump, then press jump again in air. Player gets second upward impulse. Third jump attempt does nothing. Land and can double jump again."
    },
    {
      "name": "parkour-slide",
      "category": "parkour",
      "description": "Crouch slide: when ducking while moving fast on ground (speed > pm_slideMinSpeed), ground friction is multiplied by pm_slideFriction (default 0.5), creating a long low-friction slide. Pilots only. Combined with reduced bbox from crouching to slide under obstacles.",
      "status": "passing",
      "validation": "Run fast, press crouch. Player slides with low friction, maintaining speed much longer than normal crouch walk. Slow crouch-walk has normal friction."
    },
    {
      "name": "parkour-ledgegrab",
      "category": "parkour",
      "description": "Ledge grab: when airborne moving toward a ledge at chest height, player grabs the ledge and climbs up. Two-trace detection (forward wall + downward ledge top). Loses horizontal momentum, gains upward climb velocity. Brief pm_time lockout during climb.",
      "status": "passing",
      "validation": "Jump toward a chest-height ledge. Player grabs it and climbs up onto the surface. Horizontal momentum killed during grab."
    },
    {
      "name": "parkour-vault",
      "category": "parkour",
      "description": "Vault: when moving forward into a waist-height obstacle while on ground, player smoothly hops over it maintaining speed (multiplied by pm_vaultSpeed). Teleports player on top of obstacle. For flow preservation over low barriers.",
      "status": "passing",
      "validation": "Run forward into a waist-height box. Player smoothly pops on top. Speed maintained. Cannot vault obstacles taller than pm_vaultMaxHeight."
    },
    {
      "name": "parkour-testmap",
      "category": "parkour",
      "description": "Parkour test map (parkour1) with dedicated sections: wall run straightaway, wall run curve, wall chain corridor, double jump gaps, slide tunnel, ledge grab tower, vault course, mixed course, tuning arena. Generated by tools/generate_parkour_map.py.",
      "status": "passing",
      "validation": "tools/generate_parkour_map.py generates maps/parkour1.map. tools/compile_map.sh compiles it. Server loads it with /map parkour1."
    }
  ]
}
